import sys
sys.path.append('./algorithms')

from GroupEvents import _GroupEvents
from tools import freqconvert

if __name__ == '__main__':

    ''' Известно число машин, приезжающих на автомойку в течении последних 150 часов.
     =============================
    | Число машин в час | Частота |
    |         4         |    40   |
    |         5         |    60   |
    |         6         |    30   |
    |         7         |    20   |
     =============================
    Напишите алгоритм для определения количества прибывших машин в течении 20 часов. '''

    p = freqconvert([40, 60, 30, 20])
    n = 20
    print(['4 машин', '5 машин', '6 машин', '7 машин'])
    print(_GroupEvents(p, n))